<?php
/**
 * Вывести все числа, меньшие 10000, у которых есть хотя бы одна цифра 3 и которые не делятся на 5.
 */

for ($i = 0; $i < 10000; $i++) {
  $i = (string)$i;
  if ($i < 10) {
    if ($i[0] == 3 && $i % 5 !== 0) {
      echo $i." ";
    }
    if ($i == 9) {
      echo "<br />";
    }
  }
  if ($i < 100 && $i > 9) {
    if (($i[0] == 3 || $i[1] == 3) && ($i % 5 !== 0)) {
      echo $i." ";
    }
    if ($i == 99) {
      echo "<br />";
    }
  }
  if ($i < 1000 && $i > 99) {
    if (($i[0] == 3 || $i[1] == 3 || $i[2] == 3) && ($i % 5 !== 0)) {
      echo $i." ";
    }
    if ($i == 999) {
      echo "<br />";
    }
  }
  if ($i < 10000 && $i > 999) {
    if (($i[0] == 3 || $i[1] == 3 || $i[2] == 3 || $i[3] == 3) && ($i % 5 !== 0)) {
      echo $i." ";
    }
    if ($i == 9999) {
      echo "<br />";
    }
  }
}

