<?php
/**
 *Решите  уравнение ax2+bx+c=0.
 */

$a = rand(-10, 10);
$b = rand(-10, 10);
$c = rand(-10, 10);
echo 'a= '.$a.' '.'b= '.$b.' '.'c= '.$c.'</br>'.'</br>';
//$a = 71;
//$b = 144;
//$c = 4;
$d;//Дискриминант

if ($a != 0) {

  if (($b == 0) && ($c == 0)) {
    $x1 = $x2 = 0;
    echo 'x = '.$x1;
  }

  if (($c == 0) && ($b !== 0)){
    $x1 = 0;
    $x2 = -($b / $a);
    echo 'x1 = '.$x1.'</br>'.'x2 = '.$x2;
  }

  if (($b == 0) && ($c !== 0)){
    $x1 = sqrt($c / $a);
    $x2 = -(sqrt($c / $a));
    echo 'x1 = '.$x1.'</br>'.'x2 = '.$x2;
  }

  if (($b !==0) && ($c !==0)){
    $d = pow($b, 2) - 4 * $a * $c;

    if ($d > 0) {
      $x1 = (-($b) + sqrt($d)) / (2 * $a);
      $x2 = (-($b) - sqrt($d)) / (2 * $a);
      echo 'x1 = '.$x1.'</br>'.'x2 = '.$x2;
    } elseif ($d == 0) {
      $x1 = $x2 = -$b / (2 * $a);
      echo 'x = '.$x1;
    } else {
      echo 'Нету решений';
    }
  }
} else {
 echo 'Уравнение не квадратное';
}
